{"fentybeauty_4409061435162860243": "POV: Your body on Body Lava ❤️‍🔥 You asked so we brought Body Lava back 💋 Body Lava Body Luminizer features light diffusing micro pearls that complement all skin tones & the sheer tint gives skin that post-vacay glow all year long ✨", "fentybeauty_4004318660919161052": "Gloss Bomb goals 💅🏻💅🏿💅🏽 Gloss Bomb is the stop-everything, give-it-to-me lip gloss that feels as good as it looks & comes in a variety of Fenty formulas so everyone can gloss like a boss 💋", "fentybeauty_4248157882172228719": "The cherry on top of a fire Fenty lip combo ❤️‍🔥 @olgadann wears Trace'd Out Pencil Lip Liner in 'Bored Heaux' and Gloss Bomb Heat in 'Hot Cherry' 🍒 Our hottest gloss formula delivers a hint of tint, fuller looking lips & the juiciest wet look shine 💄", "toofaced_315657731873509313": "Get ready to unwrap the secret to your best lashes yet! 😍 Our NEW Ribbon Wrapped Lash Extreme Tubing Mascara is almost here!! 🎀 This mascara delivers extreme length and separation for up to 24 hours for all lash types! No smudging, clumping, or flaking—just stunning lashes that last! ✨", "toofaced_8824032825815312599": "🛒 ADD TO CART!! 💖 It's time to treat yourself AND your makeup bag ✨ Stock up on all your #toofaced faves during our 25% OFF Friends & Family Sale 🎉 From OG classics to glam essentials, this is your chance to grab everything you love at a sweet discount! 🤑", "toofaced_1066412218767499447": "We can't get enough of this duo! 😍 Our NEW Kissing Juicy Tint gives you glossy, buildable color and hydration, while Kissing Jelly turns up the shine. Juicy, smooth, and totally irresistible 💋 Available now on toofaced.com and IG Shops! 💖", "maccosmetics_2490164948588586036": "VIVA GLAM HAS GONE GLOSSY! @kimpetras debuts an all-new limited-edition Lipglass Air hue that cares for lips AND lives: ✨SHINES LIKE GLASS ✨ in a universally stunning red 🫧FEELS LIKE AIR🫧 with a non-sticky formula 💯GIVES BACK 100%💯 to charities that support healthy futures and equal rights for all", "maccosmetics_4719694998615694208": "@zayawade #GRWMAC for her 18th birthday bash ✨. Makeup Artist @danadelaney made bedazzled lids and glossy lips the star of the show using: ✨Dazzleshadow Eyeshadow Stick in Bedazzled Denim and Demure Diamonds ✨Lip Pencil in Nightmoth ✨M·A·Cximal Silky Matte VIVA GLAM Lipstick in VIVA Equality", "narsissist_3089251083889875923": "Shades made to shine. Layer on your light with Light Reflecting Luminizing Powder's five illuminating shades—Eros, Heavenly, Electra, Ophelia, and Total Eclipse. Ethereal shades. Radiant glow. New Light Reflecting Luminizing Powder.", "narsissist_4274248375098857325": "Up your gloss game. Glide on high shine and sheer color with Afterglow Lip Shine, now with 5 new shades. What If, a rich chocolate Get Happy, a petal pink Smooth Talk, a cocoa brown Make a Move, a tawny beige Dolce Vita, iconic dusty rose", "urbandecaycosmetics_7940357825907919287": "Rule breaking never looked so good 🔥 Our All Nighter Setting Spray just got a major upgrade with new Urban Defense Pollution Protection Complex. Lock in your look for up to 16 hours while protecting against environmental stressors. #BeautifulRebel", "urbandecaycosmetics_3663130051180269243": "Naked palettes started a revolution. Now we're starting the next one with Naked3 Mini 💎 All the rosy, warm neutrals you crave in a perfectly portable size. Because sometimes less is more, but never boring. #NakedRevolution", "mkbhd_4528524907215345620": "Your phone’s flashlight vs a $750 flashlight", "mkbhd_5672927775857428042": "iOS 26... Now with way more glass", "mkbhd_7480750473013933541": "Shot on Galaxy S25 Ultra", "mkbhd_6437833182243309051": "Is this your Dad’s wallet? I have the perfect Father’s Day gift idea…", "mkbhd_5415015826678303022": "This is a USB-C rechargeable AA battery. Immediately a top 10 invention of the century. USB-C all the things 🤓", "mkbhd_6928864154030380168": "Googles new AI “Try On” feature", "mkbhd_6408391311122133755": "🙏🏾", "mkbhd_6666194336619629595": "Worst name. Best headphones. Sony’s WH-1000XM6 are out and they’ve taken back the throne. Watch the video review on YouTube!", "mkbhd_110003687931280201": "S25 Edge is official. Nobody asked for super thin phones, but here we are... making the S25 Ultra look CHUNKY", "mkbhd_8018554213380053452": "The $900 massaging shoes actually make sense", "mkbhd_2624075283038976981": "Auto Focus Channel saw it first. This car is also a boat", "mkbhd_2279362045343933081": "Enhance. Enhance. Enhance.", "techburner_0": "", "technicalguruji_0": "", "mrwhosetheboss_0": "", "maccosmetics_2258377750237916107": "Notice anything new? Here’s a clue: get in LINE...", "maccosmetics_4062606341800061170": "Going where the wind goes at the @maccosmetics NYC pride float 🪽\nJoin MAC VIVA GLAM in putting your money where your mouth is with five shades that give back 100% to supporting equal rights and healthy futures for ALL. \n\nfeaturing: @tokischa.sol \nhost: @anania00 \n\n#MACVIVAGLAM #MACPartner #ad #pride #nyc #comedy #interview #lgbt", "maccosmetics_1245005711389377035": "Just picked up @thegirljt to #GRWMAC for NYC Pride 🏳️‍🌈👑💋. Here’s everything the City Princess wore for her next-level set:\n\nON THE LIPS 💋\nLip Pencil in Chestnut\nM•A•Cximal Silky Matte Lipstick in Lipstick Snob\nLipglass Clear\n\nON THE FACE ✨\nSkinfinish Sunstruck Matte Bronzer in Rich Golden\nPowder Blush in Full Fuchsia\nStudio Fix Powder Plus Foundation in NC44.5\nDazzleshadow in Shine De-Light\nChromaline in Black Black and Rich Purple\nPro Longer Concealer\n\nON THE EYES 👀\nPowder Kiss Soft Matte Eye Shadow in Such A Tulle\nConnect In Colour Eye Shadow Palette: Encrypted Kryptonite\nM•A•CStack Mascara\n\nMUA: @becomingeden \n\n#MACLovesPride #Pride #PrideMonth #NYCPride", "maccosmetics_2290598445618037294": "NEW YORK CITY! 🗽🌈 We hit the parade route in full #MAC style – celebrating love, individuality and the beauty of our LGBTQIA+ community. With bold lips, and our larger-than-life Lipstick truck, we’re committed to driving change with five iconic VIVA GLAM shades that give back 100% to support equality and brighter futures for all.\n\nWhere should our Pride float pull up next?\n\n#MACLovesPride #MACVIVAGLAM", "maccosmetics_7015470035653784732": "Wear your HEART on your lips. #MACximal Silky Matte VIVA GLAM Lipstick in Viva Heart gives back 100% to charities championing our expanded #MACVIVAGLAM mission of gender, sexual, racial and environmental equality. \n\nM·A·C MUA: @2000syx", "maccosmetics_7023587644355198531": "You can’t cap our Pride! 🏳️‍🌈 We’re on the road to raising the next half-billion dollars for charity with five iconic shades that give back 100% to support #MACVIVAGLAM’s mission of 2SLGBTQIA+ equality and healthy futures for all. #MACLovesPride \n🎨: @hotgirlshobbies\n@maccosmeticscanada", "maccosmetics_3064793010536993201": "Soft colours made a bold statement at @jeannefriot’s SS26 “RESISTANCE” show in Paris. Key Makeup Artist @marieke_thibaut worked with a cast of trans and non-binary models to celebrate “existence, resistance, and empowerment” with multi-coloured lashes, graphic liner and glowy, fresh-faced skin.\n\n#MACBackstage #PFW", "maccosmetics_5066655103084599146": "#GRWMAC to play Lizzy in Apple TV+’s ‘The Buccaneers’ 🧚. Makeup Artist @jennyrhodesmclean gave us the full scoop on how she brought Lizzy’s (Aubri Ibrag) nostalgic-yet-playful look to life on-screen to match her ‘A Midsummer Night’s Dream’ birthday theme for Season 2, Episode 3 of ‘The Buccaneers’. Make her party look your own with: \n\n✔️Dazzleshadow Extreme in Emerald Cut \n✔️Dazzleshadow Liquid in Not Afraid To Sparkle \n✔️Glitter in Reflects Transparent Pink \n\n@aubribrag @appletv #TheBuccaneers #AppleTV", "maccosmetics_4418138130363368607": "Spoiler alert: #TheBuccaneers wear M·A·C. We went behind-the-scenes of Season 2, Episode 3 of The Buccaneers on @appletv to get an inside look at how Hair and Makeup Designer @jennyrhodesmclean transformed your favorite characters into glimmering, ethereal fairies thanks to a little magic and a whole lot of M·A·C Dazzleshadow Liquid 🧚✨.\n \n✨ Conchita’s Maximalist Look ✨\n✔️Eye Shadow in If It Ain’t Baroque\n✔️Pigment in Copper Sparkle + Mixing Medium\n✔️Frost Lipstick in Bronze Shimmer\n \n✨ Honoria’s Ethereal Look ✨\n✔️Pro Longwear Paint Pot in Bare Study\n✔️Dazzleshadow Liquid in Not Afraid To Sparkle\n✔️M·A·CStack Mascara in Chestnut Stack\n \n✨ Lizzy’s Nostalgic-Yet-Playful Look ✨\n✔️Dazzleshadow Extreme in Emerald Cut\n✔️Dazzleshadow Liquid in Not Afraid To Sparkle\n✔️Glitter in Reflects Transparent Pink\n \n✨ Mabel’s Whimsical Look ✨\n✔️Connect In Colour Eye Shadow Palette: Embedded In Burgundy\n✔️Dazzleshadow Liquid in Not Afraid To Sparkle\n✔️M·A·CStack Mascara\n \n✨ Nan’s Dreamy Look ✨\n✔️Pro Longwear Eye Shadow in If It Aint Baroque\n✔️Dazzleshadow Liquid in Not Afraid To Sparkle\n✔️Lustreglass Sheer-Shine Lipstick in Thanks, It’s M·A·C! + $ellout\n \n@appletv #TheBuccaneers #AppleTV", "maccosmetics_6941928866424713758": "Beep beep, omw to score this easy nude #MACLipCombo 🚗\nMAC Lip Pencil in Strip Down + MACximal Sleek Satin Lipstick in HodgePodge", "maccosmetics_3999333255415335082": "Grabbing some popcorn to watch hours of Film Noir on my FYP 🍿. @idil.ci wears mega-viral M·A·Cximal Sleek Satin Lipstick in Film Noir. #IWearMAC #MACximal #MACFilmNoir", "maccosmetics_7815151829985479937": "What do these iconic #MACLipCombos have in common? The Lipstick that gives back 100% to charities supporting healthy futures and equal rights for all. Let us know your fave #MACVIVAGLAM look in the comments... \n\n1️⃣ Beet + Viva Empowered \n2️⃣ Spice + Viva Equality\n3️⃣ Cherry + Viva Heart \n4️⃣ Subculture + Viva Planet \n5️⃣ Cherry + Viva Heart + Viva KIMmitment"}